// 4.2-1.cpp : このファイルには 'main' 関数が含まれています。プログラム実行の開始と終了がそこで行われます。
//

#include <iostream>

class samp {
	int a, b;
public:
	samp(int n, int m) { a = n; b = m; }
	int get_a() { return a; }
	int get_b() { return b; }
};

int main()
{
	samp ob[4] = {
	  samp(1, 2),
	  samp(3, 4),
	  samp(5, 6),
	  samp(7, 8)
	};

	int i;

	samp* p;

	p = ob; // 配列の開始アドレスを取得する
	p += 3;

	for (i = 0; i < 4; i++) {
		std::cout << p->get_a() << ' ';
		std::cout << p->get_b() << "\n";
		p--;  // 次のオブジェクトに進む
	}

	std::cout << "\n";

	return 0;
}

// プログラムの実行: Ctrl + F5 または [デバッグ] > [デバッグなしで開始] メニュー
// プログラムのデバッグ: F5 または [デバッグ] > [デバッグの開始] メニュー

// 作業を開始するためのヒント: 
//    1. ソリューション エクスプローラー ウィンドウを使用してファイルを追加/管理します 
//   2. チーム エクスプローラー ウィンドウを使用してソース管理に接続します
//   3. 出力ウィンドウを使用して、ビルド出力とその他のメッセージを表示します
//   4. エラー一覧ウィンドウを使用してエラーを表示します
//   5. [プロジェクト] > [新しい項目の追加] と移動して新しいコード ファイルを作成するか、[プロジェクト] > [既存の項目の追加] と移動して既存のコード ファイルをプロジェクトに追加します
//   6. 後ほどこのプロジェクトを再び開く場合、[ファイル] > [開く] > [プロジェクト] と移動して .sln ファイルを選択します
